# Working with DataFrames Part2

## Replace

Imports

In [1]:
import numpy as np
import pandas as pd 
from pandas import Series, DataFrame

#### Working on series

Create a series

In [20]:
# Lets make  Series
ser1 = Series([1,2,3,4,'a','b','c','d'])
#Show
ser1

0    1
1    2
2    3
3    4
4    a
5    b
6    c
7    d
dtype: object

Replace a value in a Series

In [21]:
# .replace(value to be replaced, new_value)

ser1.replace(4 ,np.nan)

0      1
1      2
2      3
3    NaN
4      a
5      b
6      c
7      d
dtype: object

In [22]:
ser1

0    1
1    2
2    3
3    4
4    a
5    b
6    c
7    d
dtype: object

In [23]:
#Can also input lists
ser1.replace([1,'b'],[100,400])

0    100
1      2
2      3
3      4
4      a
5    400
6      c
7      d
dtype: object

In [24]:
#Can also input dictionary
ser1.replace({1:100, 'b':400, 'd':np.nan})

0    100
1      2
2      3
3      4
4      a
5    400
6      c
7    NaN
dtype: object

### Replace on DataFrame

In [15]:
# df creation
df = DataFrame({'city':['Bogotà','Quito','Lhasa'],
                'altitude':[2640, 2850, 3250]})

#Show
df

     city  altitude
0  Bogotà      2640
1   Quito      2850
2   Lhasa      3250

We can replace values in two ways:

* 1. Selecting the column where we want to replace the value
* 2. Selecting all the data frame

In [16]:
# Selecting the column where we want to replace the value
df['city'].replace('Bogotà','Lima', inplace=True)

In [17]:
# show
df

    city  altitude
0   Lima      2640
1  Quito      2850
2  Lhasa      3250

In [19]:
# Selecting all the data frame
df.replace(2640, 1500)

    city  altitude
0   Lima      1500
1  Quito      2850
2  Lhasa      3250